//! Type Coercion  /  تحويل نوع البيانات تلقائيا من جافا سكربت


// يتم تحويل المصفوفة الى نص يحتوي على عناصرها مفصولة بفاصلة في حالة العمليات الحسابية اذا كانت تحتوي على عناصر
// يتم تحويل المصفوفة الى نص فارغ اذا كانت فارغه في حالة العمليات الحسابية

/*


* اذا العميله جمع 
-اذا كان احد الاطراف العميله نص يتم تحويل الطرف الاخر الى نص  مهما كان نوعه ايضا ويتم جمع النصوص
-اذا كان الطرفين رقم يتم جمعهم كأرقام
-اذا كان احد الطرفين بولين يتم تحويله الى رقم 1 او 0 حسب قيمته ويتم جمعهم كأرقام
-اذا كان احد الطرفين نل أو اندفايند يتم تحويله الى 0 ويتم جمعهم كأرقام
-اذا كان احد الطرفين كائن يتم تحويله الى primitive (عادة نص أو رقم) ويتم جمعهم حسب نوع الprimitive 


* إذا بولين موجود  حوّل بولين الى نمبر
* إذا نص موجود  حوّل نص الي نمبر
* إذا نل أو انديفايند موجود → حوّل نل و انديفايند إلى 0
* إذا كائن موجود → حوّل كائن إلى بريماتيف (عادة نص أو رقم)


/*


* اذا العميله طرح أو ضرب أو قسمة
-اذا كان الطرفين رقم يتم طرحهم أو ضربهم أو قسمتهم كأرقام
-اذا كان احد الطرفين بولين يتم تحويله الى رقم 1 او 0 حسب قيمته ويتم طرحهم أو ضربهم أو قسمتهم كأرقام
-اذا كان احد الطرفين نل أو اندفايند يتم تحويله الى 0 ويتم طرحهم أو ضربهم أو قسمتهم كأرقام
-اذا كان احد الطرفين نص يتم تحويله الى رقم اذا كان النص يمثل رقم صالح، وإلا يتم تحويله إلى نان ويتم طرحهم أو ضربهم أو قسمتهم كأرقام
-اذا كان احد الطرفين كائن يتم تحويله الى بريماتيف (عادة نص أو رقم) ويتم طرحهم أو ضربهم أو قسمتهم حسب نوع بريماتيف

*/

//?[] + []                                                                                  ""

//?[] + 1                                                                                  "1"

//?[] + {}                                                                                  "[object Object]"

//?{} + []                                                                                  0

//?[1] + 1                                                                                 "11"

//?[1, 2] + 3                                                                              "1,23"

//?"5" - 2                                                                                 3

//?"10" * "2"                                                                               20

//?true - 1                                                                               0

//?[] - 1                                                                              -1

//?[1] * 2                                                                              2

//?[1,2] - 1                                                                              NaN

//?{} * 2                                                                              NaN

//?[] + 1 + 2                                                                              "12"

//?[1] + [2]                                                                             "12"


//?[1,2] + [3,4]                                                                         "1,23,4"

//?[[],[]] + 1                                                                             ",1"

//?[1,[2]] + 3                                                                              "1,23"

//?[0] - []                                                                                 0

//?[1] - true                                                                               0

//?[] + ![]

//?[1] + ![] 

// ? 5 + "5"                                                                                "55"

//? "5" - 5                                                                                  0

//? "5" * "5"                                                                                25
     
//? "5" / "5"                                                                                1

//? "10" - 2                                                                                 8

//? "10" * 2                                                                                 20

//? "10" / 2                                                                                 5

// يتم تحويل ترو الى 1 في حالة العمليات الحسابية
// ? true + 1                                                                                2 

// يتم تحويل فولس الى 0 في حالة العمليات الحسابية
//? false + 1                                                                                1

//?  "7" * "2"                                                                               14

//?  "7" * ""                                                                                0

// comparison

//---------------------------------------------- اذا الانواع مختلفة يتم تحويل النوعين الى نوع مشترك في حالة المقارنة غير الصارمة  

/*


* في حالة المقارنة غير الصارمة يتم تحويل النوعين الى نوع مشترك اذا كانت الانواع مختلفة

* إذا بولين موجود  حوّل بولين الى نمبر
* إذا نص موجود  حوّل نص الي نمبر
* إذا null أو undefined موجود → حوّل null و undefined إلى 0
* إذا كائن موجود → حوّل كائن إلى primitive (عادة نص أو رقم)

*/

// لانه يتم تحويل "5" الى 5 في حالة المقارنة غير الصارمة
//? 5 == "5"                                                                               true

// لانه يتم مقارنة النوعين ايضا في حالة المقارنة الصارمة
//? 5 === "5"                                                                              false


// اذا تمت المقارنه بين رقم وترو يتم تحويل الترو الى 1 في حالة المقارنة غير الصارمة
//? 0 == false                                                                             true

//?true == 1

//? 0 === false                                                                            false

//? null == undefined                                                                      true

//? null === undefined                                                                     false

// في حال مقارنه الكائنات يتم مقارنة المراجع وليس القيم في كل من المقارنة الصارمة وغير الصارمة
//? {} == {}                                                                               false

// لانه يتم تحويل المصفوفة بريماتيف  في حالة المقارنة  
// اذا الانواع مختلفة يتم تحويل النوعين الى نوع مشترك في حالة المقارنة غير الصارمة  فيتم تحويل المصفوفة الى نص فارغ اذا كانت فارغه في حالة العمليات الحسابية   
//?[] == false                                                                             true

//?[] == 0                                                                                 true

//?[] == ""                                                                                true

//?[] === false                                                                            false

//?[] == ![]                                                                               true

//?[] === ![]                                                                              false

//?true == 1                                                                               true

//?false == 0                                                                              true

//?"" == 0                                                                                 true

//?"" === 0                                                                              false

//?[0] == false                                                                             true

//? [0] == 0                                                                                 true

//?[1] == true                                                                              true

//?[1,2] == "1,2"                                                                            true

//?null == 0                                                                               true

//?undefined == 0                                                                          true

//?undefined == NaN                                                                          false

//?{} == {}                                                                               false

//?[] == []                                                                               false

//?{} === {}                                                                              false

//?[] === []                                                                              false

//?[1] == [1]                                                                               false

//?null == null                                                                             true

//?undefined == undefined                                                                   true

//?NaN == NaN                                                                               false

//?null == undefined                                                                      true

//?"0" == false                                                                             true

//?"" == false                                                                             true

//?" " == true                                                                              true

//?[0] == ![0]                                                                              true

//?[1,[2]] == "1,2"

//?Boolean(0)                                                                              false

//?Boolean("0")                                                                            true

//?Boolean("")                                                                             false

//?Boolean(null)                                                                           false

//?Boolean(undefined)                                                                      false

//?Boolean(NaN)                                                                            false

//?Boolean([])                                                                             true
                                                                                        
//?Boolean({})                                                                             true







